app/Controllers/admin/Home.php

    public function index(): string
    {
        $data['page_title'] = "Dashboard";
        $StudentModel = model(StudentModel::class); // Assuming StudentModel is the name of your model
        $ComplainModel = model(ComplainModel::class); // Assuming StudentModel is the name of your model


        $data['student_count'] = $StudentModel->countAll(); // Get the count of all students
---
SELECT COUNT(*) AS `numrows` FROM `students`